In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('SHSD_Open_Data_1980_2021.csv')
df1.head()

,LA_CODE,LA_NAME,LAD20CD,LAD20NM,LAD20TYPE,CTY20CD,CTY20NM,MCTY20CD,MCTY20NM,RGN20CD,RGN20NM,CTRY20CD,CTRY20NM,Year,Provider,Disposal Type,Disposal Detail Tier 1,Disposal Detail Tier 2,Units
0,E07000157,Alnwick,E06000057,Northumberland,E06,NaN,NaN,NaN,NaN,E12000001,North East,E92000001,England,1997-98,LA,Demolition,Demolition,Demolition,0.0
1,E07000158,Berwick-upon-Tweed,E06000057,Northumberland,E06,NaN,NaN,NaN,NaN,E12000001,North East,E92000001,England,1997-98,LA,Demolition,Demolition,Demolition,0.0
2,E07000159,Blyth Valley,E06000057,Northumberland,E06,NaN,NaN,NaN,NaN,E12000001,North East,E92000001,England,1997-98,LA,Demolition,Demolition,Demolition,0.0
3,E07000160,Castle Morpeth,E06000057,Northumberland,E06,NaN,NaN,NaN,NaN,E12000001,North East,E92000001,England,1997-98,LA,Demolition,Demolition,Demolition,0.0
4,E07000054,Chester-le-Street,E06000047,County Durham,E06,NaN,NaN,NaN,NaN,E12000001,North East,E92000001,England,1997-98,LA,Demolition,Demolition,Demolition,0.0

In [3]:
df_t = df1[['LA_CODE','LA_NAME','Year','Disposal Type','Units']].groupby(['LA_CODE','LA_NAME','Year','Disposal Type']).sum()

In [4]:
df_t.reset_index(inplace=True)
df_t.columns = ['LA_code','LA','year','type','units']

In [5]:
df_t = df_t.pivot(index=['LA_code','LA','year'],columns='type',values='units')

In [6]:
df_t.reset_index(inplace=True)

In [9]:
df_t.replace(np.nan, 0,inplace=True)
df_t['total'] = df_t['Demolition'] + df_t['Sale']
df_t.head()

type    LA_code          LA     year  Demolition    Sale   total
0     E06000001  Hartlepool  1980-81         0.0    38.0    38.0
1     E06000001  Hartlepool  1981-82         0.0  1109.0  1109.0
2     E06000001  Hartlepool  1982-83         0.0   727.0   727.0
3     E06000001  Hartlepool  1983-84         0.0   184.0   184.0
4     E06000001  Hartlepool  1984-85         0.0   176.0   176.0

In [15]:
dates = {}
for x in list(range(1980,2021)):
    string = f'{x}-{str(x+1)[2:]}'
    date = x+1
    dates.update({string:date})

In [17]:
df_t.replace(dates,inplace=True)

In [18]:
df_t[df_t.loc[:,'LA']=='Coventry']

type     LA_code        LA  year  Demolition   Sale  total
12352  E08000026  Coventry  1981         0.0    8.0    8.0
12353  E08000026  Coventry  1982         0.0  472.0  472.0
12354  E08000026  Coventry  1983         0.0  768.0  768.0
12355  E08000026  Coventry  1984         0.0  454.0  454.0
12356  E08000026  Coventry  1985         0.0  297.0  297.0
12357  E08000026  Coventry  1986         0.0  407.0  407.0
12358  E08000026  Coventry  1987         0.0  380.0  380.0
12359  E08000026  Coventry  1988         0.0  537.0  537.0
12360  E08000026  Coventry  1989         0.0  968.0  968.0
12361  E08000026  Coventry  1990         0.0  726.0  726.0
12362  E08000026  Coventry  1991         0.0  286.0  286.0
12363  E08000026  Coventry  1992         0.0  199.0  199.0
12364  E08000026  Coventry  1993         0.0  123.0  123.0
12365  E08000026  Coventry  1994         0.0  136.0  136.0
12366  E08000026  Coventry  1995         0.0  144.0  144.0
12367  E08000026  Coventry  1996         0.0  117.0  117.0
12368  E08000026  Coventry  1997         0.0  144.0  144.0
12369  E08000026  Coventry  1998       120.0  198.0  318.0
12370  E08000026  Coventry  1999         0.0  180.0  180.0
12371  E08000026  Coventry  2000         0.0  298.0  298.0
12372  E08000026  Coventry  2001         0.0  105.0  105.0
12373  E08000026  Coventry  2002         0.0    0.0    0.0
12374  E08000026  Coventry  2003         0.0    0.0    0.0
12375  E08000026  Coventry  2004         0.0    0.0    0.0
12376  E08000026  Coventry  2005         0.0    0.0    0.0
12377  E08000026  Coventry  2006         0.0    0.0    0.0
12378  E08000026  Coventry  2007         0.0    0.0    0.0
12379  E08000026  Coventry  2008         0.0    0.0    0.0
12380  E08000026  Coventry  2009         0.0    0.0    0.0
12381  E08000026  Coventry  2010         0.0    0.0    0.0
12382  E08000026  Coventry  2011         0.0    0.0    0.0
12383  E08000026  Coventry  2012        76.0   47.0  123.0
12384  E08000026  Coventry  2013        82.0   64.0  146.0
12385  E08000026  Coventry  2014        15.0   91.0  106.0
12386  E08000026  Coventry  2015        31.0  115.0  146.0
12387  E08000026  Coventry  2016        33.0  143.0  176.0
12388  E08000026  Coventry  2017        41.0  120.0  161.0
12389  E08000026  Coventry  2018        22.0  141.0  163.0
12390  E08000026  Coventry  2019       167.0  116.0  283.0
12391  E08000026  Coventry  2020         0.0  225.0  225.0
12392  E08000026  Coventry  2021        29.0  112.0  141.0

In [19]:
df_t.to_excel('cleaned datasets/Social Housing Deductions.xlsx')